Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxGtm_regdef.h
/** \brief ICM Interrupt Group Register Covering GTM Output Sub-Modules ATOM4 to ATOM7 */
typedef struct _Ifx_GTM_ICM_IRQG_R10_Bits
{
    Ifx_Strict_32Bit ATOM4_CH0_IRQ:1;    /**< \brief [0:0] ATOM4 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH1_IRQ:1;    /**< \brief [1:1] ATOM4 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH2_IRQ:1;    /**< \brief [2:2] ATOM4 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH3_IRQ:1;    /**< \brief [3:3] ATOM4 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH4_IRQ:1;    /**< \brief [4:4] ATOM4 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH5_IRQ:1;    /**< \brief [5:5] ATOM4 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH6_IRQ:1;    /**< \brief [6:6] ATOM4 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM4_CH7_IRQ:1;    /**< \brief [7:7] ATOM4 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH0_IRQ:1;    /**< \brief [8:8] ATOM5 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH1_IRQ:1;    /**< \brief [9:9] ATOM5 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH2_IRQ:1;    /**< \brief [10:10] ATOM5 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH3_IRQ:1;    /**< \brief [11:11] ATOM5 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH4_IRQ:1;    /**< \brief [12:12] ATOM5 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH5_IRQ:1;    /**< \brief [13:13] ATOM5 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH6_IRQ:1;    /**< \brief [14:14] ATOM5 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM5_CH7_IRQ:1;    /**< \brief [15:15] ATOM5 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH0_IRQ:1;    /**< \brief [16:16] ATOM6 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH1_IRQ:1;    /**< \brief [17:17] ATOM6 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH2_IRQ:1;    /**< \brief [18:18] ATOM6 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH3_IRQ:1;    /**< \brief [19:19] ATOM6 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH4_IRQ:1;    /**< \brief [20:20] ATOM6 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH5_IRQ:1;    /**< \brief [21:21] ATOM6 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH6_IRQ:1;    /**< \brief [22:22] ATOM6 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM6_CH7_IRQ:1;    /**< \brief [23:23] ATOM6 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH0_IRQ:1;    /**< \brief [24:24] ATOM7 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH1_IRQ:1;    /**< \brief [25:25] ATOM7 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH2_IRQ:1;    /**< \brief [26:26] ATOM7 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH3_IRQ:1;    /**< \brief [27:27] ATOM7 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH4_IRQ:1;    /**< \brief [28:28] ATOM7 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH5_IRQ:1;    /**< \brief [29:29] ATOM7 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH6_IRQ:1;    /**< \brief [30:30] ATOM7 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM7_CH7_IRQ:1;    /**< \brief [31:31] ATOM7 channel 7 shared interrupt (r) */
} Ifx_GTM_ICM_IRQG_R10_Bits;

/** \brief ICM Interrupt Group Register Covering GTM Output Sub-Modules ATOM8 to ATOM11 */
typedef struct _Ifx_GTM_ICM_IRQG_R11_Bits
{
    Ifx_Strict_32Bit ATOM8_CH0_IRQ:1;    /**< \brief [0:0] ATOM8 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH1_IRQ:1;    /**< \brief [1:1] ATOM8 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH2_IRQ:1;    /**< \brief [2:2] ATOM8 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH3_IRQ:1;    /**< \brief [3:3] ATOM8 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH4_IRQ:1;    /**< \brief [4:4] ATOM8 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH5_IRQ:1;    /**< \brief [5:5] ATOM8 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH6_IRQ:1;    /**< \brief [6:6] ATOM8 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM8_CH7_IRQ:1;    /**< \brief [7:7] ATOM8 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH0_IRQ:1;    /**< \brief [8:8] ATOM9 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH1_IRQ:1;    /**< \brief [9:9] ATOM9 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH2_IRQ:1;    /**< \brief [10:10] ATOM9 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH3_IRQ:1;    /**< \brief [11:11] ATOM9 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH4_IRQ:1;    /**< \brief [12:12] ATOM9 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH5_IRQ:1;    /**< \brief [13:13] ATOM9 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH6_IRQ:1;    /**< \brief [14:14] ATOM9 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM9_CH7_IRQ:1;    /**< \brief [15:15] ATOM9 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH0_IRQ:1;    /**< \brief [16:16] ATOM10 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH1_IRQ:1;    /**< \brief [17:17] ATOM10 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH2_IRQ:1;    /**< \brief [18:18] ATOM10 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH3_IRQ:1;    /**< \brief [19:19] ATOM10 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH4_IRQ:1;    /**< \brief [20:20] ATOM10 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH5_IRQ:1;    /**< \brief [21:21] ATOM10 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH6_IRQ:1;    /**< \brief [22:22] ATOM10 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM10_CH7_IRQ:1;    /**< \brief [23:23] ATOM10 channel 7 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH0_IRQ:1;    /**< \brief [24:24] ATOM11 channel 0 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH1_IRQ:1;    /**< \brief [25:25] ATOM11 channel 1 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH2_IRQ:1;    /**< \brief [26:26] ATOM11 channel 2 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH3_IRQ:1;    /**< \brief [27:27] ATOM11 channel 3 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH4_IRQ:1;    /**< \brief [28:28] ATOM11 channel 4 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH5_IRQ:1;    /**< \brief [29:29] ATOM11 channel 5 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH6_IRQ:1;    /**< \brief [30:30] ATOM11 channel 6 shared interrupt (r) */
    Ifx_Strict_32Bit ATOM11_CH7_IRQ:1;    /**< \brief [31:31] ATOM11 channel 7 shared interrupt (r) */
} Ifx_GTM_ICM_IRQG_R11_Bits;

